<?php
  class map{
    static private $map = NULL;
	static private $map_id = NULL;
	private function __construct(){
		/*
		* 0 - 40 пустые клетки
		* 1 - 3 стрелка вверх
		* 2 - 3 стрелка двунаправленная по диагонали
		* 3 - 3 стрелка по диагонали
		* 4 - 3 в четыре стороны по диагонали
		* 5 - 3 в четыре стороны (вверх, вниз и вправо)
		* 6 - 3 на СЗ, Восток и Юг
		* 7 - 3 стрелка двунаправленная влево-вправо
		* 8 - 2 кони
		* 9 - 5 вертушки на 2 хода
		* 10 - 4 вертушка на 3 хода
		* 11 - 2 вертушка на 4 хода
		* 12 - 1 вертушка на 5 ходов
		* 13 - 6 лед
		* 14 - 3 капкан
		* 15 - 2 пушка
		* 16 - 2 крепость
		* 17 - 1 аборигенка
		* 18 - 4 ром
		* 19 - 4 крокодил
		* 20 - 1 людоед
		* 21 - 2 воздушный шар
		* 22 - 1 самолет
		* 23 - 5 клад 1 монета
		* 24 - 5 клад 2 монеты
		* 25 - 3 клад 3 монеты
		* 26 - 2 клад 4 монеты
		* 27 - 1 клад 5 монет
		*/
		$list_of_possible_cells = array(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,2,2,2,3,3,3,4,4,4,5,5,5,6,6,6,7,7,7,8,8,9,9,9,9,9,10,10,10,10,11,11,12,13,13,13,13,13,13,14,14,14,15,15,16,16,17,18,18,18,18,19,19,19,19,20,21,21,22,23,23,23,23,23,24,24,24,24,24,25,25,25,26,26,27);
		shuffle($list_of_possible_cells);
		$r = 0;
		for($i = 0; $i < 121; $i++){
			
		}
	} 
	private function __clone(){
		
	} 
	private function get_map_from_db(){
		
	}
	static function get_map(){
		if(self::$id === NULL){
			if(self::$map == NULL){
				self::$map = new map();
			}
		}else{
			
		}
		return self::$map;
	}
  }
?>
